# ViewerReferenceLabel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewerReferenceLabel Property
ParameterTypeId Class See Also
---
"Reference Label"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewerReferenceLabel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewerReferenceLabel As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewerReferenceLabel {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace